tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18346_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF18346_H_
#define _PIC16LF18346_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PORTB                         35
#define RB4                           36
#define RB5                           37
#define RB6                           38
#define RB7                           39
#define PORTC                         40
#define RC0                           41
#define RC1                           42
#define RC2                           43
#define RC3                           44
#define RC4                           45
#define RC5                           46
#define RC6                           47
#define RC7                           48
#define PIR0                          49
#define INTF                          50
#define IOCIF                         51
#define TMR0IF                        52
#define PIR1                          53
#define TMR1IF                        54
#define TMR2IF                        55
#define BCL1IF                        56
#define SSP1IF                        57
#define TXIF                          58
#define RCIF                          59
#define ADIF                          60
#define TMR1GIF                       61
#define PIR2                          62
#define NCO1IF                        63
#define TMR4IF                        64
#define BCL2IF                        65
#define SSP2IF                        66
#define NVMIF                         67
#define C1IF                          68
#define C2IF                          69
#define TMR6IF                        70
#define PIR3                          71
#define CLC1IF                        72
#define CLC2IF                        73
#define CLC3IF                        74
#define CLC4IF                        75
#define TMR3IF                        76
#define TMR3GIF                       77
#define CSWIF                         78
#define OSFIF                         79
#define PIR4                          80
#define CCP1IF                        81
#define CCP2IF                        82
#define CCP3IF                        83
#define CCP4IF                        84
#define TMR5IF                        85
#define TMR5GIF                       86
#define CWG1IF                        87
#define CWG2IF                        88
#define TMR00                         89
#define TMR0L                         90
#define TMR01                         91
#define TMR02                         92
#define TMR03                         93
#define TMR04                         94
#define TMR05                         95
#define TMR06                         96
#define TMR07                         97
#define TMR08                         98
#define TMR0H                         99
#define TMR09                         100
#define TMR010                        101
#define TMR011                        102
#define TMR012                        103
#define TMR013                        104
#define TMR014                        105
#define TMR015                        106
#define T0CON0                        107
#define T0OUTPS                       108
#define T0OUTPS0                      109
#define T0OUTPS1                      110
#define T0OUTPS2                      111
#define T0OUTPS3                      112
#define T016BIT                       113
#define T0OUT                         114
#define T0EN                          115
#define T0CON1                        116
#define T0CKPS                        117
#define T0CKPS0                       118
#define T0CKPS1                       119
#define T0CKPS2                       120
#define T0CKPS3                       121
#define T0ASYNC                       122
#define T0CS                          123
#define T0CS0                         124
#define T0CS1                         125
#define T0CS2                         126
#define TMR1L                         127
#define TMR1H                         128
#define T1CON                         129
#define TMR1ON                        130
#define T1SYNC                        131
#define T1SOSC                        132
#define T1CKPS0                       133
#define T1CKPS                        134
#define T1CKPS1                       135
#define TMR1CS0                       136
#define TMR1CS                        137
#define TMR1CS1                       138
#define T1GCON                        139
#define T1GSS0                        140
#define T1GSS                         141
#define T1GSS1                        142
#define T1GVAL                        143
#define T1GGO_nDONE                   144
#define T1GSPM                        145
#define T1GTM                         146
#define T1GPOL                        147
#define TMR1GE                        148
#define TMR2                          149
#define PR2                           150
#define T2CON                         151
#define T2CKPS0                       152
#define T2CKPS                        153
#define T2CKPS1                       154
#define TMR2ON                        155
#define T2OUTPS0                      156
#define T2OUTPS                       157
#define T2OUTPS1                      158
#define T2OUTPS2                      159
#define T2OUTPS3                      160
#define TRISA                         161
#define TRISA0                        162
#define TRISA1                        163
#define TRISA2                        164
#define TRISA4                        165
#define TRISA5                        166
#define TRISB                         167
#define TRISB4                        168
#define TRISB5                        169
#define TRISB6                        170
#define TRISB7                        171
#define TRISC                         172
#define TRISC0                        173
#define TRISC1                        174
#define TRISC2                        175
#define TRISC3                        176
#define TRISC4                        177
#define TRISC5                        178
#define TRISC6                        179
#define TRISC7                        180
#define PIE0                          181
#define INTE                          182
#define IOCIE                         183
#define TMR0IE                        184
#define PIE1                          185
#define TMR1IE                        186
#define TMR2IE                        187
#define BCL1IE                        188
#define SSP1IE                        189
#define TXIE                          190
#define RCIE                          191
#define ADIE                          192
#define TMR1GIE                       193
#define PIE2                          194
#define NCO1IE                        195
#define TMR4IE                        196
#define BCL2IE                        197
#define SSP2IE                        198
#define NVMIE                         199
#define C1IE                          200
#define C2IE                          201
#define TMR6IE                        202
#define PIE3                          203
#define CLC1IE                        204
#define CLC2IE                        205
#define CLC3IE                        206
#define CLC4IE                        207
#define TMR3IE                        208
#define TMR3GIE                       209
#define CSWIE                         210
#define OSFIE                         211
#define PIE4                          212
#define CCP1IE                        213
#define CCP2IE                        214
#define CCP3IE                        215
#define CCP4IE                        216
#define TMR5IE                        217
#define TMR5GIE                       218
#define CWG1IE                        219
#define CWG2IE                        220
#define WDTCON                        221
#define SWDTEN                        222
#define WDTPS                         223
#define WDTPS0                        224
#define WDTPS1                        225
#define WDTPS2                        226
#define WDTPS3                        227
#define WDTPS4                        228
#define ADRESL                        229
#define ADRESH                        230
#define ADCON0                        231
#define ADON                          232
#define GO_nDONE                      233
#define GO                            234
#define ADGO                          235
#define CHS0                          236
#define CHS                           237
#define CHS1                          238
#define CHS2                          239
#define CHS3                          240
#define CHS4                          241
#define CHS5                          242
#define ADCON1                        243
#define ADPREF0                       244
#define ADPREF                        245
#define ADPREF1                       246
#define ADNREF                        247
#define ADCS0                         248
#define ADCS                          249
#define ADCS1                         250
#define ADCS2                         251
#define ADFM                          252
#define ADACT0                        253
#define ADACT                         254
#define ADACT1                        255
#define ADACT2                        256
#define ADACT3                        257
#define ADACT4                        258
#define LATA                          259
#define LATA0                         260
#define LATA1                         261
#define LATA2                         262
#define LATA4                         263
#define LATA5                         264
#define LATB                          265
#define LATB4                         266
#define LATB5                         267
#define LATB6                         268
#define LATB7                         269
#define LATC                          270
#define LATC0                         271
#define LATC1                         272
#define LATC2                         273
#define LATC3                         274
#define LATC4                         275
#define LATC5                         276
#define LATC6                         277
#define LATC7                         278
#define CM1CON0                       279
#define C1SYNC                        280
#define C1HYS                         281
#define C1SP                          282
#define C1POL                         283
#define C1OUT                         284
#define C1ON                          285
#define CM1CON1                       286
#define C1NCH0                        287
#define C1NCH                         288
#define C1NCH1                        289
#define C1NCH2                        290
#define C1PCH                         291
#define C1PCH0                        292
#define C1PCH1                        293
#define C1PCH2                        294
#define C1INTN                        295
#define C1INTP                        296
#define CM2CON0                       297
#define C2SYNC                        298
#define C2HYS                         299
#define C2SP                          300
#define C2POL                         301
#define C2OUT                         302
#define C2ON                          303
#define CM2CON1                       304
#define C2NCH0                        305
#define C2NCH                         306
#define C2NCH1                        307
#define C2NCH2                        308
#define C2PCH                         309
#define C2PCH0                        310
#define C2PCH1                        311
#define C2PCH2                        312
#define C2INTN                        313
#define C2INTP                        314
#define CMOUT                         315
#define MC1OUT                        316
#define MC2OUT                        317
#define BORCON                        318
#define BORRDY                        319
#define SBOREN                        320
#define FVRCON                        321
#define ADFVR0                        322
#define ADFVR                         323
#define ADFVR1                        324
#define CDAFVR                        325
#define CDAFVR0                       326
#define CDAFVR1                       327
#define TSRNG                         328
#define TSEN                          329
#define FVRRDY                        330
#define FVREN                         331
#define DACCON0                       332
#define DAC1NSS                       333
#define DAC1PSS                       334
#define DAC1PSS0                      335
#define DAC1PSS1                      336
#define DAC1OE                        337
#define DAC1EN                        338
#define DACCON1                       339
#define DAC1R                         340
#define DAC1R0                        341
#define DAC1R1                        342
#define DAC1R2                        343
#define DAC1R3                        344
#define DAC1R4                        345
#define ANSELA                        346
#define ANSA0                         347
#define ANSA1                         348
#define ANSA2                         349
#define ANSA4                         350
#define ANSA5                         351
#define ANSELB                        352
#define ANSB4                         353
#define ANSB5                         354
#define ANSB6                         355
#define ANSB7                         356
#define ANSELC                        357
#define ANSC0                         358
#define ANSC1                         359
#define ANSC2                         360
#define ANSC3                         361
#define ANSC4                         362
#define ANSC5                         363
#define ANSC6                         364
#define ANSC7                         365
#define RC1REG                        366
#define TX1REG                        367
#define SP1BRGL                       368
#define SP1BRGH                       369
#define RC1STA                        370
#define RX9D                          371
#define OERR                          372
#define FERR                          373
#define ADDEN                         374
#define CREN                          375
#define SREN                          376
#define RX9                           377
#define SPEN                          378
#define TX1STA                        379
#define TX9D                          380
#define TRMT                          381
#define BRGH                          382
#define SENDB                         383
#define SYNC                          384
#define TXEN                          385
#define TX9                           386
#define CSRC                          387
#define BAUD1CON                      388
#define ABDEN                         389
#define WUE                           390
#define BRG16                         391
#define SCKP                          392
#define RCIDL                         393
#define ABDOVF                        394
#define WPUA                          395
#define WPUA0                         396
#define WPUA1                         397
#define WPUA2                         398
#define WPUA3                         399
#define WPUA4                         400
#define WPUA5                         401
#define WPUB                          402
#define WPUB4                         403
#define WPUB5                         404
#define WPUB6                         405
#define WPUB7                         406
#define WPUC                          407
#define WPUC0                         408
#define WPUC1                         409
#define WPUC2                         410
#define WPUC3                         411
#define WPUC4                         412
#define WPUC5                         413
#define WPUC6                         414
#define WPUC7                         415
#define SSP1BUF_BUF                   416
#define SSP1BUF_BUF0                  417
#define SSP1BUF                       418
#define SSP1BUF0                      419
#define SSP1BUF_BUF1                  420
#define SSP1BUF1                      421
#define SSP1BUF_BUF2                  422
#define SSP1BUF2                      423
#define SSP1BUF_BUF3                  424
#define SSP1BUF3                      425
#define SSP1BUF_BUF4                  426
#define SSP1BUF4                      427
#define SSP1BUF_BUF5                  428
#define SSP1BUF5                      429
#define SSP1BUF_BUF6                  430
#define SSP1BUF6                      431
#define SSP1BUF_BUF7                  432
#define SSP1BUF7                      433
#define SSP1ADD_ADD0                  434
#define SSP1ADD_ADD                   435
#define SSP1ADD0                      436
#define SSP1ADD                       437
#define SSP1ADD_ADD1                  438
#define SSP1ADD1                      439
#define SSP1ADD_ADD2                  440
#define SSP1ADD2                      441
#define SSP1ADD_ADD3                  442
#define SSP1ADD3                      443
#define SSP1ADD_ADD4                  444
#define SSP1ADD4                      445
#define SSP1ADD_ADD5                  446
#define SSP1ADD5                      447
#define SSP1ADD_ADD6                  448
#define SSP1ADD6                      449
#define SSP1ADD_ADD7                  450
#define SSP1ADD7                      451
#define SSP1MSK_MSK0                  452
#define SSP1MSK0                      453
#define SSP1MSK_MSK                   454
#define SSP1MSK                       455
#define SSP1MSK_MSK1                  456
#define SSP1MSK1                      457
#define SSP1MSK_MSK2                  458
#define SSP1MSK2                      459
#define SSP1MSK_MSK3                  460
#define SSP1MSK3                      461
#define SSP1MSK_MSK4                  462
#define SSP1MSK4                      463
#define SSP1MSK_MSK5                  464
#define SSP1MSK5                      465
#define SSP1MSK_MSK6                  466
#define SSP1MSK6                      467
#define SSP1MSK_MSK7                  468
#define SSP1MSK7                      469
#define SSP1STAT                      470
#define SSP1STAT_BF                   471
#define SSP1STAT_UA                   472
#define SSP1STAT_R_nW                 473
#define SSP1STAT_S                    474
#define SSP1STAT_P                    475
#define SSP1STAT_D_nA                 476
#define SSP1STAT_CKE                  477
#define SSP1STAT_SMP                  478
#define SSP1CON1                      479
#define SSP1CON1_SSPM                 480
#define SSP1CON1_SSPM0                481
#define SSP1CON1_SSPM1                482
#define SSP1CON1_SSPM2                483
#define SSP1CON1_SSPM3                484
#define SSP1CON1_CKP                  485
#define SSP1CON1_SSPEN                486
#define SSP1CON1_SSPOV                487
#define SSP1CON1_WCOL                 488
#define SSP1CON2                      489
#define SSP1CON2_SEN                  490
#define SSP1CON2_RSEN                 491
#define SSP1CON2_PEN                  492
#define SSP1CON2_RCEN                 493
#define SSP1CON2_ACKEN                494
#define SSP1CON2_ACKDT                495
#define SSP1CON2_ACKSTAT              496
#define SSP1CON2_GCEN                 497
#define SSP1CON3                      498
#define SSP1CON3_DHEN                 499
#define SSP1CON3_AHEN                 500
#define SSP1CON3_SBCDE                501
#define SSP1CON3_SDAHT                502
#define SSP1CON3_BOEN                 503
#define SSP1CON3_SCIE                 504
#define SSP1CON3_PCIE                 505
#define SSP1CON3_ACKTIM               506
#define SSP2BUF                       507
#define SSP2BUF_BUF0                  508
#define SSP2BUF_BUF                   509
#define SSP2BUF0                      510
#define SSP2BUF_BUF1                  511
#define SSP2BUF1                      512
#define SSP2BUF_BUF2                  513
#define SSP2BUF2                      514
#define SSP2BUF_BUF3                  515
#define SSP2BUF3                      516
#define SSP2BUF_BUF4                  517
#define SSP2BUF4                      518
#define SSP2BUF_BUF5                  519
#define SSP2BUF5                      520
#define SSP2BUF_BUF6                  521
