tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18346_tdd.h
#define SSP2BUF6                      522
#define SSP2BUF_BUF7                  523
#define SSP2BUF7                      524
#define SSP2ADD_ADD0                  525
#define SSP2ADD0                      526
#define SSP2ADD_ADD                   527
#define SSP2ADD                       528
#define SSP2ADD_ADD1                  529
#define SSP2ADD1                      530
#define SSP2ADD_ADD2                  531
#define SSP2ADD2                      532
#define SSP2ADD_ADD3                  533
#define SSP2ADD3                      534
#define SSP2ADD_ADD4                  535
#define SSP2ADD4                      536
#define SSP2ADD_ADD5                  537
#define SSP2ADD5                      538
#define SSP2ADD_ADD6                  539
#define SSP2ADD6                      540
#define SSP2ADD_ADD7                  541
#define SSP2ADD7                      542
#define SSP2MSK_MSK0                  543
#define SSP2MSK                       544
#define SSP2MSK0                      545
#define SSP2MSK_MSK                   546
#define SSP2MSK_MSK1                  547
#define SSP2MSK1                      548
#define SSP2MSK_MSK2                  549
#define SSP2MSK2                      550
#define SSP2MSK_MSK3                  551
#define SSP2MSK3                      552
#define SSP2MSK_MSK4                  553
#define SSP2MSK4                      554
#define SSP2MSK_MSK5                  555
#define SSP2MSK5                      556
#define SSP2MSK_MSK6                  557
#define SSP2MSK6                      558
#define SSP2MSK_MSK7                  559
#define SSP2MSK7                      560
#define SSP2STAT                      561
#define SSP2STAT_BF                   562
#define SSP2STAT_UA                   563
#define SSP2STAT_R_nW                 564
#define SSP2STAT_S                    565
#define SSP2STAT_P                    566
#define SSP2STAT_D_nA                 567
#define SSP2STAT_CKE                  568
#define SSP2STAT_SMP                  569
#define SSP2CON1                      570
#define SSP2CON1_SSPM                 571
#define SSP2CON1_SSPM0                572
#define SSP2CON1_SSPM1                573
#define SSP2CON1_SSPM2                574
#define SSP2CON1_SSPM3                575
#define SSP2CON1_CKP                  576
#define SSP2CON1_SSPEN                577
#define SSP2CON1_SSPOV                578
#define SSP2CON1_WCOL                 579
#define SSP2CON2                      580
#define SSP2CON2_SEN                  581
#define SSP2CON2_RSEN                 582
#define SSP2CON2_PEN                  583
#define SSP2CON2_RCEN                 584
#define SSP2CON2_ACKEN                585
#define SSP2CON2_ACKDT                586
#define SSP2CON2_ACKSTAT              587
#define SSP2CON2_GCEN                 588
#define SSP2CON3                      589
#define SSP2CON3_DHEN                 590
#define SSP2CON3_AHEN                 591
#define SSP2CON3_SBCDE                592
#define SSP2CON3_SDAHT                593
#define SSP2CON3_BOEN                 594
#define SSP2CON3_SCIE                 595
#define SSP2CON3_PCIE                 596
#define SSP2CON3_ACKTIM               597
#define ODCONA                        598
#define ODCA0                         599
#define ODCA1                         600
#define ODCA2                         601
#define ODCA4                         602
#define ODCA5                         603
#define ODCONB                        604
#define ODCB4                         605
#define ODCB5                         606
#define ODCB6                         607
#define ODCB7                         608
#define ODCONC                        609
#define ODCC0                         610
#define ODCC1                         611
#define ODCC2                         612
#define ODCC3                         613
#define ODCC4                         614
#define ODCC5                         615
#define ODCC6                         616
#define ODCC7                         617
#define CCPR1L                        618
#define CCPR1H                        619
#define CCP1CON                       620
#define CCP1MODE                      621
#define CCP1MODE0                     622
#define CCP1MODE1                     623
#define CCP1MODE2                     624
#define CCP1MODE3                     625
#define CCP1FMT                       626
#define CCP1OUT                       627
#define CCP1EN                        628
#define CCP1CAP                       629
#define CCP1CTS                       630
#define CCP1CTS0                      631
#define CCP1CTS1                      632
#define CCP1CTS2                      633
#define CCP1CTS3                      634
#define CCPR2L                        635
#define CCPR2H                        636
#define CCP2CON                       637
#define CCP2MODE                      638
#define CCP2MODE0                     639
#define CCP2MODE1                     640
#define CCP2MODE2                     641
#define CCP2MODE3                     642
#define CCP2FMT                       643
#define CCP2OUT                       644
#define CCP2EN                        645
#define CCP2CAP                       646
#define CCP2CTS                       647
#define CCP2CTS0                      648
#define CCP2CTS1                      649
#define CCP2CTS2                      650
#define CCP2CTS3                      651
#define CCPTMRS                       652
#define C1TSEL0                       653
#define C1TSEL                        654
#define C1TSEL1                       655
#define C2TSEL0                       656
#define C2TSEL                        657
#define C2TSEL1                       658
#define C3TSEL0                       659
#define C3TSEL                        660
#define C3TSEL1                       661
#define C4TSEL                        662
#define C4TSEL0                       663
#define C4TSEL1                       664
#define SLRCONA                       665
#define SLRA0                         666
#define SLRA1                         667
#define SLRA2                         668
#define SLRA4                         669
#define SLRA5                         670
#define SLRCONB                       671
#define SLRB4                         672
#define SLRB5                         673
#define SLRB6                         674
#define SLRB7                         675
#define SLRCONC                       676
#define SLRC0                         677
#define SLRC1                         678
#define SLRC2                         679
#define SLRC3                         680
#define SLRC4                         681
#define SLRC5                         682
#define SLRC6                         683
#define SLRC7                         684
#define CCPR3L                        685
#define CCPR3H                        686
#define CCP3CON                       687
#define CCP3MODE0                     688
#define CCP3MODE                      689
#define CCP3MODE1                     690
#define CCP3MODE2                     691
#define CCP3MODE3                     692
#define CCP3FMT                       693
#define CCP3OUT                       694
#define CCP3EN                        695
#define CCP3CAP                       696
#define CCP3CTS                       697
#define CCP3CTS0                      698
#define CCP3CTS1                      699
#define CCP3CTS2                      700
#define CCP3CTS3                      701
#define CCPR4L                        702
#define CCPR4H                        703
#define CCP4CON                       704
#define CCP4MODE                      705
#define CCP4MODE0                     706
#define CCP4MODE1                     707
#define CCP4MODE2                     708
#define CCP4MODE3                     709
#define CCP4FMT                       710
#define CCP4OUT                       711
#define CCP4EN                        712
#define CCP4CAP                       713
#define CCP4CTS                       714
#define CCP4CTS0                      715
#define CCP4CTS1                      716
#define CCP4CTS2                      717
#define CCP4CTS3                      718
#define INLVLA                        719
#define INLVLA0                       720
#define INLVLA1                       721
#define INLVLA2                       722
#define INLVLA3                       723
#define INLVLA4                       724
#define INLVLA5                       725
#define INLVLB                        726
#define INLVLB4                       727
#define INLVLB5                       728
#define INLVLB6                       729
#define INLVLB7                       730
#define INLVLC                        731
#define INLVLC0                       732
#define INLVLC1                       733
#define INLVLC2                       734
#define INLVLC3                       735
#define INLVLC4                       736
#define INLVLC5                       737
#define INLVLC6                       738
#define INLVLC7                       739
#define IOCAP                         740
#define IOCAP0                        741
#define IOCAP1                        742
#define IOCAP2                        743
#define IOCAP3                        744
#define IOCAP4                        745
#define IOCAP5                        746
#define IOCAN                         747
#define IOCAN0                        748
#define IOCAN1                        749
#define IOCAN2                        750
#define IOCAN3                        751
#define IOCAN4                        752
#define IOCAN5                        753
#define IOCAF                         754
#define IOCAF0                        755
#define IOCAF1                        756
#define IOCAF2                        757
#define IOCAF3                        758
#define IOCAF4                        759
#define IOCAF5                        760
#define IOCBP                         761
#define IOCBP4                        762
#define IOCBP5                        763
#define IOCBP6                        764
#define IOCBP7                        765
#define IOCBN                         766
#define IOCBN4                        767
#define IOCBN5                        768
#define IOCBN6                        769
#define IOCBN7                        770
#define IOCBF                         771
#define IOCBF4                        772
#define IOCBF5                        773
#define IOCBF6                        774
#define IOCBF7                        775
#define IOCCP                         776
#define IOCCP0                        777
#define IOCCP1                        778
#define IOCCP2                        779
#define IOCCP3                        780
#define IOCCP4                        781
#define IOCCP5                        782
#define IOCCP6                        783
#define IOCCP7                        784
#define IOCCN                         785
#define IOCCN0                        786
#define IOCCN1                        787
#define IOCCN2                        788
#define IOCCN3                        789
#define IOCCN4                        790
#define IOCCN5                        791
#define IOCCN6                        792
#define IOCCN7                        793
#define IOCCF                         794
#define IOCCF0                        795
#define IOCCF1                        796
#define IOCCF2                        797
#define IOCCF3                        798
#define IOCCF4                        799
#define IOCCF5                        800
#define IOCCF6                        801
#define IOCCF7                        802
#define CLKRCON                       803
#define CLKRDIV                       804
#define CLKRDIV0                      805
#define CLKRDIV1                      806
#define CLKRDIV2                      807
#define CLKRDC                        808
#define CLKRDC0                       809
#define CLKRDC1                       810
#define CLKREN                        811
#define MDCON                         812
#define MDBIT                         813
#define MDOUT                         814
#define MDOPOL                        815
#define MDEN                          816
#define MDSRC                         817
#define MDMS0                         818
#define MDMS                          819
#define MDMS1                         820
#define MDMS2                         821
#define MDMS3                         822
#define MDCARH                        823
#define MDCH                          824
#define MDCH0                         825
#define MDCH1                         826
#define MDCH2                         827
#define MDCH3                         828
#define MDCHSYNC                      829
#define MDCHPOL                       830
#define MDCARL                        831
#define MDCL0                         832
#define MDCL                          833
#define MDCL1                         834
#define MDCL2                         835
#define MDCL3                         836
#define MDCLSYNC                      837
#define MDCLPOL                       838
#define CCDNA                         839
#define CCDNA0                        840
#define CCDNA1                        841
#define CCDNA2                        842
#define CCDNA4                        843
#define CCDNA5                        844
#define CCDNB                         845
#define CCDNB4                        846
#define CCDNB5                        847
#define CCDNB6                        848
#define CCDNB7                        849
#define CCDNC                         850
#define CCDNC0                        851
#define CCDNC1                        852
#define CCDNC2                        853
#define CCDNC3                        854
#define CCDNC4                        855
#define CCDNC5                        856
#define CCDNC6                        857
#define CCDNC7                        858
#define TMR3L                         859
#define TMR3H                         860
#define T3CON                         861
#define TMR3ON                        862
#define T3SYNC                        863
#define T3SOSC                        864
#define T3CKPS                        865
#define T3CON_T3CKPS0                 866
#define T3CON_T3CKPS1                 867
#define TMR3CS0                       868
#define TMR3CS                        869
#define TMR3CS1                       870
#define T3GCON                        871
#define T3GSS0                        872
#define T3GSS                         873
#define T3GSS1                        874
#define T3GVAL                        875
#define T3GGO_nDONE                   876
#define T3GSPM                        877
#define T3GTM                         878
#define T3GPOL                        879
#define TMR3GE                        880
#define TMR4                          881
#define PR4                           882
#define T4CON                         883
#define T4CON_T3CKPS0                 884
#define T4CKPS                        885
#define T4CON_T3CKPS1                 886
#define TMR4ON                        887
#define T4CON_TOUTPS                  888
#define T4CON_TOUTPS0                 889
#define T4CON_TOUTPS1                 890
#define T4CON_TOUTPS2                 891
#define T4CON_TOUTPS3                 892
#define TMR5L                         893
#define TMR5H                         894
#define T5CON                         895
#define TMR5ON                        896
#define T5SYNC                        897
#define T5SOSC                        898
#define T5CKPS                        899
#define T5CKPS0                       900
#define T5CKPS1                       901
#define TMR5CS0                       902
#define TMR5CS                        903
#define TMR5CS1                       904
#define T5GCON                        905
#define T5GSS                         906
#define T5GSS0                        907
#define T5GSS1                        908
#define T5GVAL                        909
#define T5GGO_nDONE                   910
#define T5GSPM                        911
#define T5GTM                         912
#define T5GPOL                        913
#define TMR5GE                        914
#define TMR6                          915
#define PR6                           916
#define T6CON                         917
#define T6CKPS0                       918
#define T6CKPS                        919
#define T6CKPS1                       920
#define TMR6ON                        921
#define T6CON_TOUTPS0                 922
#define T6CON_TOUTPS                  923
#define T6CON_TOUTPS1                 924
#define T6CON_TOUTPS2                 925
#define T6CON_TOUTPS3                 926
#define CCDCON                        927
#define CCDS                          928
#define CCDS0                         929
#define CCDS1                         930
#define CCDEN                         931
#define CCDPA                         932
#define CCDPA0                        933
#define CCDPA1                        934
#define CCDPA2                        935
#define CCDPA4                        936
#define CCDPA5                        937
#define CCDPB                         938
#define CCDPB4                        939
#define CCDPB5                        940
#define CCDPB6                        941
#define CCDPB7                        942
#define CCDPC                         943
#define CCDPC0                        944
#define CCDPC1                        945
#define CCDPC2                        946
#define CCDPC3                        947
#define CCDPC4                        948
#define CCDPC5                        949
#define CCDPC6                        950
#define CCDPC7                        951
#define NCO1ACCL                      952
#define NCO1ACCL_NCO1ACC              953
#define NCO1ACCH                      954
#define NCO1ACCH_NCO1ACC              955
#define NCO1ACCU                      956
#define NCO1ACCU_NCO1ACC              957
#define NCO1INCL                      958
#define NCO1INCL_NCO1INC              959
#define NCO1INCH                      960
#define NCO1INCH_NCO1INC              961
#define NCO1INCU                      962
#define NCO1INCU_NCO1INC              963
#define NCO1CON                       964
#define N1PFM                         965
#define N1POL                         966
#define N1OUT                         967
#define N1EN                          968
#define NCO1CLK                       969
#define N1CKS                         970
#define N1PWS                         971
#define PWM5DCL                       972
#define PWM5DCL0                      973
#define PWM5DCL1                      974
#define PWM5DCH                       975
#define PWM5DCH0                      976
#define PWM5DCH1                      977
#define PWM5DCH2                      978
#define PWM5DCH3                      979
#define PWM5DCH4                      980
#define PWM5DCH5                      981
#define PWM5DCH6                      982
#define PWM5DCH7                      983
#define PWM5CON                       984
#define PWM5POL                       985
#define PWM5OUT                       986
#define PWM5EN                        987
#define PWM6DCL                       988
#define PWM6DCL0                      989
#define PWM6DCL1                      990
#define PWM6DCH                       991
#define PWM6DCH0                      992
#define PWM6DCH1                      993
#define PWM6DCH2                      994
#define PWM6DCH3                      995
#define PWM6DCH4                      996
#define PWM6DCH5                      997
#define PWM6DCH6                      998
#define PWM6DCH7                      999
#define PWM6CON                       1000
#define PWM6POL                       1001
#define PWM6OUT                       1002
#define PWM6EN                        1003
#define PWMTMRS                       1004
#define P5TSEL                        1005
#define P5TSEL0                       1006
#define P5TSEL1                       1007
#define P6TSEL0                       1008
#define P6TSEL                        1009
#define P6TSEL1                       1010
#define CWG1CLKCON                    1011
#define CWG1CLKCON_CS                 1012
#define CWG1CS                        1013
#define CWG1DAT                       1014
#define CWG1DAT_DAT                   1015
#define CWG1DAT0                      1016
#define CWG1DAT1                      1017
#define CWG1DAT2                      1018
#define CWG1DAT3                      1019
#define CWG1DBR_DBR                   1020
#define CWG1DBR0                      1021
#define CWG1DBR_DBR0                  1022
#define CWG1DBR                       1023
#define CWG1DBR1                      1024
#define CWG1DBR_DBR1                  1025
#define CWG1DBR2                      1026
#define CWG1DBR_DBR2                  1027
#define CWG1DBR3                      1028
#define CWG1DBR_DBR3                  1029
#define CWG1DBR_DBR4                  1030
#define CWG1DBR4                      1031
#define CWG1DBR5                      1032
#define CWG1DBR_DBR5                  1033
#define CWG1DBF                       1034
#define CWG1DBF0                      1035
#define CWG1DBF_DBF                   1036
#define CWG1DBF_DBF0                  1037
#define CWG1DBF1                      1038
#define CWG1DBF_DBF1                  1039
#define CWG1DBF_DBF2                  1040
#define CWG1DBF2                      1041
#define CWG1DBF3                      1042
#define CWG1DBF_DBF3                  1043
#define CWG1DBF_DBF4                  1044
#define CWG1DBF4                      1045
#define CWG1DBF_DBF5                  1046
#define CWG1DBF5                      1047
#define CWG1CON0                      1048
#define CWG1MODE0                     1049
#define CWG1CON0_MODE                 1050
#define CWG1CON0_MODE0                1051
#define CWG1MODE                      1052
#define CWG1MODE1                     1053
#define CWG1CON0_MODE1                1054
#define CWG1MODE2                     1055
#define CWG1CON0_MODE2                1056
#define CWG1CON0_LD                   1057
#define CWG1LD                        1058
#define CWG1EN                        1059
#define G1EN                          1060
#define CWG1CON0_EN                   1061
#define CWG1CON1                      1062
#define CWG1POLA                      1063
#define CWG1CON1_POLA                 1064
#define CWG1CON1_POLB                 1065
#define CWG1POLB                      1066
#define CWG1POLC                      1067
#define CWG1CON1_POLC                 1068
#define CWG1CON1_POLD                 1069
#define CWG1POLD                      1070
#define CWG1CON1_IN                   1071
#define CWG1IN                        1072
#define CWG1AS0                       1073
#define CWG1LSAC                      1074
#define CWG1AS0_LSAC0                 1075
#define CWG1AS0_LSAC                  1076
#define CWG1LSAC0                     1077
#define CWG1AS0_LSAC1                 1078
#define CWG1LSAC1                     1079
#define CWG1AS0_LSBD0                 1080
#define CWG1LSBD0                     1081
#define CWG1LSBD                      1082
#define CWG1AS0_LSBD                  1083
#define CWG1LSBD1                     1084
#define CWG1AS0_LSBD1                 1085
#define CWG1AS0_REN                   1086
#define CWG1REN                       1087
#define CWG1AS0_SHUTDOWN              1088
#define CWG1SHUTDOWN                  1089
#define CWG1AS1                       1090
