tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18346_tdd.h
#define CWG1AS1_AS0E                  1091
#define CWG1AS1_AS1E                  1092
#define CWG1AS1_AS2E                  1093
#define CWG1AS1_AS3E                  1094
#define CWG1AS1_AS4E                  1095
#define CWG1STR                       1096
#define CWG1STRA                      1097
#define CWG1STR_STRA                  1098
#define CWG1STRB                      1099
#define CWG1STR_STRB                  1100
#define CWG1STRC                      1101
#define CWG1STR_STRC                  1102
#define CWG1STR_STRD                  1103
#define CWG1STRD                      1104
#define CWG1OVRA                      1105
#define CWG1STR_OVRA                  1106
#define CWG1OVRB                      1107
#define CWG1STR_OVRB                  1108
#define CWG1OVRC                      1109
#define CWG1STR_OVRC                  1110
#define CWG1OVRD                      1111
#define CWG1STR_OVRD                  1112
#define CWG2CLKCON                    1113
#define CWG2CS                        1114
#define CWG2CLKCON_CS                 1115
#define CWG2DAT                       1116
#define CWG2DAT0                      1117
#define CWG2DAT_DAT                   1118
#define CWG2DAT1                      1119
#define CWG2DAT2                      1120
#define CWG2DAT3                      1121
#define CWG2DBR_DBR                   1122
#define CWG2DBR_DBR0                  1123
#define CWG2DBR                       1124
#define CWG2DBR0                      1125
#define CWG2DBR_DBR1                  1126
#define CWG2DBR1                      1127
#define CWG2DBR_DBR2                  1128
#define CWG2DBR2                      1129
#define CWG2DBR_DBR3                  1130
#define CWG2DBR3                      1131
#define CWG2DBR_DBR4                  1132
#define CWG2DBR4                      1133
#define CWG2DBR_DBR5                  1134
#define CWG2DBR5                      1135
#define CWG2DBF                       1136
#define CWG2DBF_DBF0                  1137
#define CWG2DBF_DBF                   1138
#define CWG2DBF0                      1139
#define CWG2DBF_DBF1                  1140
#define CWG2DBF1                      1141
#define CWG2DBF_DBF2                  1142
#define CWG2DBF2                      1143
#define CWG2DBF_DBF3                  1144
#define CWG2DBF3                      1145
#define CWG2DBF_DBF4                  1146
#define CWG2DBF4                      1147
#define CWG2DBF5                      1148
#define CWG2DBF_DBF5                  1149
#define CWG2CON0                      1150
#define CWG2MODE                      1151
#define CWG2MODE0                     1152
#define CWG2CON0_MODE                 1153
#define CWG2CON0_MODE0                1154
#define CWG2MODE1                     1155
#define CWG2CON0_MODE1                1156
#define CWG2MODE2                     1157
#define CWG2CON0_MODE2                1158
#define CWG2LD                        1159
#define CWG2CON0_LD                   1160
#define CWG2CON0_EN                   1161
#define CWG2EN                        1162
#define G2EN                          1163
#define CWG2CON1                      1164
#define CWG2POLA                      1165
#define CWG2CON1_POLA                 1166
#define CWG2POLB                      1167
#define CWG2CON1_POLB                 1168
#define CWG2POLC                      1169
#define CWG2CON1_POLC                 1170
#define CWG2CON1_POLD                 1171
#define CWG2POLD                      1172
#define CWG2IN                        1173
#define CWG2CON1_IN                   1174
#define CWG2AS0                       1175
#define CWG2LSAC                      1176
#define CWG2AS0_LSAC                  1177
#define CWG2LSAC0                     1178
#define CWG2AS0_LSAC0                 1179
#define CWG2LSAC1                     1180
#define CWG2AS0_LSAC1                 1181
#define CWG2AS0_LSBD0                 1182
#define CWG2LSBD                      1183
#define CWG2AS0_LSBD                  1184
#define CWG2LSBD0                     1185
#define CWG2AS0_LSBD1                 1186
#define CWG2LSBD1                     1187
#define CWG2AS0_REN                   1188
#define CWG2REN                       1189
#define CWG2AS0_SHUTDOWN              1190
#define CWG2SHUTDOWN                  1191
#define CWG2AS1                       1192
#define CWG2AS1_AS0E                  1193
#define CWG2AS1_AS1E                  1194
#define CWG2AS1_AS2E                  1195
#define CWG2AS1_AS3E                  1196
#define CWG2AS1_AS4E                  1197
#define CWG2STR                       1198
#define CWG2STR_STRA                  1199
#define CWG2STRA                      1200
#define CWG2STR_STRB                  1201
#define CWG2STRB                      1202
#define CWG2STR_STRC                  1203
#define CWG2STRC                      1204
#define CWG2STR_STRD                  1205
#define CWG2STRD                      1206
#define CWG2STR_OVRA                  1207
#define CWG2OVRA                      1208
#define CWG2OVRB                      1209
#define CWG2STR_OVRB                  1210
#define CWG2STR_OVRC                  1211
#define CWG2OVRC                      1212
#define CWG2OVRD                      1213
#define CWG2STR_OVRD                  1214
#define NVMADR0                       1215
#define NVMADRL                       1216
#define NVMADR1                       1217
#define NVMADR2                       1218
#define NVMADR3                       1219
#define NVMADR4                       1220
#define NVMADR5                       1221
#define NVMADR6                       1222
#define NVMADR7                       1223
#define NVMADR8                       1224
#define NVMADRH                       1225
#define NVMADR9                       1226
#define NVMADR10                      1227
#define NVMADR11                      1228
#define NVMADR12                      1229
#define NVMADR13                      1230
#define NVMADR14                      1231
#define NVMDAT0                       1232
#define NVMDATL                       1233
#define NVMDAT1                       1234
#define NVMDAT2                       1235
#define NVMDAT3                       1236
#define NVMDAT4                       1237
#define NVMDAT5                       1238
#define NVMDAT6                       1239
#define NVMDAT7                       1240
#define NVMDAT8                       1241
#define NVMDATH                       1242
#define NVMDAT9                       1243
#define NVMDAT10                      1244
#define NVMDAT11                      1245
#define NVMDAT12                      1246
#define NVMDAT13                      1247
#define NVMCON1                       1248
#define RD                            1249
#define WR                            1250
#define WREN                          1251
#define WRERR                         1252
#define FREE                          1253
#define LWLO                          1254
#define NVMREGS                       1255
#define NVMCON2                       1256
#define NMVCON2                       1257
#define PCON0                         1258
#define nBOR                          1259
#define nPOR                          1260
#define nRI                           1261
#define nRMCLR                        1262
#define nRWDT                         1263
#define STKUNF                        1264
#define STKOVF                        1265
#define PMD0                          1266
#define IOCMD                         1267
#define CLKRMD                        1268
#define NVMMD                         1269
#define FVRMD                         1270
#define SYSCMD                        1271
#define PMD1                          1272
#define TMR0MD                        1273
#define TMR1MD                        1274
#define TMR2MD                        1275
#define TMR3MD                        1276
#define TMR4MD                        1277
#define TMR5MD                        1278
#define TMR6MD                        1279
#define NCOMD                         1280
#define PMD2                          1281
#define CMP1MD                        1282
#define CMP2MD                        1283
#define ADCMD                         1284
#define DACMD                         1285
#define PMD3                          1286
#define CCP1MD                        1287
#define CCP2MD                        1288
#define CCP3MD                        1289
#define CCP4MD                        1290
#define PWM5MD                        1291
#define PWM6MD                        1292
#define CWG1MD                        1293
#define CWG2MD                        1294
#define PMD4                          1295
#define MSSP1MD                       1296
#define MSSP2MD                       1297
#define UART1MD                       1298
#define PMD5                          1299
#define DSMMD                         1300
#define CLC1MD                        1301
#define CLC2MD                        1302
#define CLC3MD                        1303
#define CLC4MD                        1304
#define CPUDOZE                       1305
#define DOZE0                         1306
#define DOZE                          1307
#define DOZE1                         1308
#define DOZE2                         1309
#define DOE                           1310
#define ROI                           1311
#define DOZEN                         1312
#define IDLEN                         1313
#define OSCCON1                       1314
#define NDIV0                         1315
#define NDIV                          1316
#define NDIV1                         1317
#define NDIV2                         1318
#define NDIV3                         1319
#define NOSC0                         1320
#define NOSC                          1321
#define NOSC1                         1322
#define NOSC2                         1323
#define OSCCON2                       1324
#define CDIV0                         1325
#define CDIV                          1326
#define CDIV1                         1327
#define CDIV2                         1328
#define CDIV3                         1329
#define COSC                          1330
#define COSC0                         1331
#define COSC1                         1332
#define COSC2                         1333
#define OSCCON3                       1334
#define NOSCR                         1335
#define ORDY                          1336
#define SOSCBE                        1337
#define SOSCPWR                       1338
#define CSWHOLD                       1339
#define OSCSTAT1                      1340
#define PLLR                          1341
#define ADOR                          1342
#define SOR                           1343
#define LFOR                          1344
#define HFOR                          1345
#define EXTOR                         1346
#define OSCEN                         1347
#define ADOEN                         1348
#define SOSCEN                        1349
#define LFOEN                         1350
#define HFOEN                         1351
#define EXTOEN                        1352
#define OSCTUNE                       1353
#define HFTUN0                        1354
#define HFTUN                         1355
#define HFTUN1                        1356
#define HFTUN2                        1357
#define HFTUN3                        1358
#define HFTUN4                        1359
#define HFTUN5                        1360
#define OSCFRQ                        1361
#define HFFRQ                         1362
#define HFFRQ0                        1363
#define HFFRQ1                        1364
#define HFFRQ2                        1365
#define HFFRQ3                        1366
#define PPSLOCK                       1367
#define PPSLOCKED                     1368
#define INTPPS0                       1369
#define INTPPS                        1370
#define INTPPS1                       1371
#define INTPPS2                       1372
#define INTPPS3                       1373
#define INTPPS4                       1374
#define T0CKIPPS0                     1375
#define T0CKIPPS                      1376
#define T0CKIPPS1                     1377
#define T0CKIPPS2                     1378
#define T0CKIPPS3                     1379
#define T0CKIPPS4                     1380
#define T1CKIPPS0                     1381
#define T1CKIPPS                      1382
#define T1CKIPPS1                     1383
#define T1CKIPPS2                     1384
#define T1CKIPPS3                     1385
#define T1CKIPPS4                     1386
#define T1GPPS0                       1387
#define T1GPPS                        1388
#define T1GPPS1                       1389
#define T1GPPS2                       1390
#define T1GPPS3                       1391
#define T1GPPS4                       1392
#define CCP1PPS0                      1393
#define CCP1PPS                       1394
#define CCP1PPS1                      1395
#define CCP1PPS2                      1396
#define CCP1PPS3                      1397
#define CCP1PPS4                      1398
#define CCP2PPS0                      1399
#define CCP2PPS                       1400
#define CCP2PPS1                      1401
#define CCP2PPS2                      1402
#define CCP2PPS3                      1403
#define CCP2PPS4                      1404
#define CCP3PPS0                      1405
#define CCP3PPS                       1406
#define CCP3PPS1                      1407
#define CCP3PPS2                      1408
#define CCP3PPS3                      1409
#define CCP3PPS4                      1410
#define CCP4PPS0                      1411
#define CCP4PPS                       1412
#define CCP4PPS1                      1413
#define CCP4PPS2                      1414
#define CCP4PPS3                      1415
#define CCP4PPS4                      1416
#define CWG1PPS0                      1417
#define CWG1PPS                       1418
#define CWG1PPS1                      1419
#define CWG1PPS2                      1420
#define CWG1PPS3                      1421
#define CWG1PPS4                      1422
#define CWG2PPS0                      1423
#define CWG2PPS                       1424
#define CWG2PPS1                      1425
#define CWG2PPS2                      1426
#define CWG2PPS3                      1427
#define CWG2PPS4                      1428
#define MDCIN1PPS                     1429
#define MDCIN1PPS0                    1430
#define MDCIN1PPS1                    1431
#define MDCIN1PPS2                    1432
#define MDCIN1PPS3                    1433
#define MDCIN1PPS4                    1434
#define MDCIN2PPS0                    1435
#define MDCIN2PPS                     1436
#define MDCIN2PPS1                    1437
#define MDCIN2PPS2                    1438
#define MDCIN2PPS3                    1439
#define MDCIN2PPS4                    1440
#define MDMINPPS                      1441
#define MDMINPPS0                     1442
#define MDMINPPS1                     1443
#define MDMINPPS2                     1444
#define MDMINPPS3                     1445
#define MDMINPPS4                     1446
#define SSP2CLKPPS                    1447
#define SSP2CLKPPS0                   1448
#define SSP2CLKPPS1                   1449
#define SSP2CLKPPS2                   1450
#define SSP2CLKPPS3                   1451
#define SSP2CLKPPS4                   1452
#define SSP2DATPPS                    1453
#define SSP2DATPPS0                   1454
#define SSP2DATPPS1                   1455
#define SSP2DATPPS2                   1456
#define SSP2DATPPS3                   1457
#define SSP2DATPPS4                   1458
#define SSP2SSPPS                     1459
#define SSP2SSPPS0                    1460
#define SSP2SSPPS1                    1461
#define SSP2SSPPS2                    1462
#define SSP2SSPPS3                    1463
#define SSP2SSPPS4                    1464
#define SSP1CLKPPS0                   1465
#define SSP1CLKPPS                    1466
#define SSP1CLKPPS1                   1467
#define SSP1CLKPPS2                   1468
#define SSP1CLKPPS3                   1469
#define SSP1CLKPPS4                   1470
#define SSP1DATPPS0                   1471
#define SSP1DATPPS                    1472
#define SSP1DATPPS1                   1473
#define SSP1DATPPS2                   1474
#define SSP1DATPPS3                   1475
#define SSP1DATPPS4                   1476
#define SSP1SSPPS                     1477
#define SSP1SSPPS0                    1478
#define SSP1SSPPS1                    1479
#define SSP1SSPPS2                    1480
#define SSP1SSPPS3                    1481
#define SSP1SSPPS4                    1482
#define RXPPS                         1483
#define RXDTPPS0                      1484
#define RXDTPPS1                      1485
#define RXDTPPS2                      1486
#define RXDTPPS3                      1487
#define RXDTPPS4                      1488
#define TXCKPPS0                      1489
#define TXPPS                         1490
#define TXCKPPS1                      1491
#define TXCKPPS2                      1492
#define TXCKPPS3                      1493
#define TXCKPPS4                      1494
#define CLCIN0PPS                     1495
#define CLCIN0PPS0                    1496
#define CLCIN0PPS1                    1497
#define CLCIN0PPS2                    1498
#define CLCIN0PPS3                    1499
#define CLCIN0PPS4                    1500
#define CLCIN1PPS0                    1501
#define CLCIN1PPS                     1502
#define CLCIN1PPS1                    1503
#define CLCIN1PPS2                    1504
#define CLCIN1PPS3                    1505
#define CLCIN1PPS4                    1506
#define CLCIN2PPS                     1507
#define CLCIN2PPS0                    1508
#define CLCIN2PPS1                    1509
#define CLCIN2PPS2                    1510
#define CLCIN2PPS3                    1511
#define CLCIN2PPS4                    1512
#define CLCIN3PPS                     1513
#define CLCIN3PPS0                    1514
#define CLCIN3PPS1                    1515
#define CLCIN3PPS2                    1516
#define CLCIN3PPS3                    1517
#define CLCIN3PPS4                    1518
#define T3CKIPPS                      1519
#define T3GPPS                        1520
#define T5CKIPPS                      1521
#define T5GPPS                        1522
#define RA0PPS                        1523
#define RA0PPS0                       1524
#define RA0PPS1                       1525
#define RA0PPS2                       1526
#define RA0PPS3                       1527
#define RA0PPS4                       1528
#define RA1PPS                        1529
#define RA1PPS0                       1530
#define RA1PPS1                       1531
#define RA1PPS2                       1532
#define RA1PPS3                       1533
#define RA1PPS4                       1534
#define RA2PPS0                       1535
#define RA2PPS                        1536
#define RA2PPS1                       1537
#define RA2PPS2                       1538
#define RA2PPS3                       1539
#define RA2PPS4                       1540
#define RA4PPS                        1541
#define RA4PPS0                       1542
#define RA4PPS1                       1543
#define RA4PPS2                       1544
#define RA4PPS3                       1545
#define RA4PPS4                       1546
#define RA5PPS                        1547
#define RA5PPS0                       1548
#define RA5PPS1                       1549
#define RA5PPS2                       1550
#define RA5PPS3                       1551
#define RA5PPS4                       1552
#define RB4PPS                        1553
#define RB4PPS0                       1554
#define RB4PPS1                       1555
#define RB4PPS2                       1556
#define RB4PPS3                       1557
#define RB4PPS4                       1558
#define RB5PPS                        1559
#define RB5PPS0                       1560
#define RB5PPS1                       1561
#define RB5PPS2                       1562
#define RB5PPS3                       1563
#define RB5PPS4                       1564
#define RB6PPS0                       1565
#define RB6PPS                        1566
#define RB6PPS1                       1567
#define RB6PPS2                       1568
#define RB6PPS3                       1569
#define RB6PPS4                       1570
#define RB7PPS0                       1571
#define RB7PPS                        1572
#define RB7PPS1                       1573
#define RB7PPS2                       1574
#define RB7PPS3                       1575
#define RB7PPS4                       1576
#define RC0PPS                        1577
#define RC0PPS0                       1578
#define RC0PPS1                       1579
#define RC0PPS2                       1580
#define RC0PPS3                       1581
#define RC0PPS4                       1582
#define RC1PPS0                       1583
#define RC1PPS                        1584
#define RC1PPS1                       1585
#define RC1PPS2                       1586
#define RC1PPS3                       1587
#define RC1PPS4                       1588
#define RC2PPS                        1589
#define RC2PPS0                       1590
#define RC2PPS1                       1591
#define RC2PPS2                       1592
#define RC2PPS3                       1593
#define RC2PPS4                       1594
#define RC3PPS                        1595
#define RC3PPS0                       1596
#define RC3PPS1                       1597
#define RC3PPS2                       1598
#define RC3PPS3                       1599
#define RC3PPS4                       1600
#define RC4PPS0                       1601
#define RC4PPS                        1602
#define RC4PPS1                       1603
#define RC4PPS2                       1604
#define RC4PPS3                       1605
#define RC4PPS4                       1606
#define RC5PPS0                       1607
#define RC5PPS                        1608
#define RC5PPS1                       1609
#define RC5PPS2                       1610
#define RC5PPS3                       1611
#define RC5PPS4                       1612
#define RC6PPS                        1613
#define RC6PPS0                       1614
#define RC6PPS1                       1615
#define RC6PPS2                       1616
#define RC6PPS3                       1617
#define RC6PPS4                       1618
#define RC7PPS                        1619
#define RC7PPS0                       1620
#define RC7PPS1                       1621
#define RC7PPS2                       1622
#define RC7PPS3                       1623
#define RC7PPS4                       1624
#define CLCDATA                       1625
#define MLC1OUT                       1626
#define MLC2OUT                       1627
#define MLC3OUT                       1628
#define MLC4OUT                       1629
#define CLC1CON                       1630
#define CLC1CON_MODE0                 1631
#define LC1MODE                       1632
#define CLC1CON_MODE                  1633
#define LC1MODE0                      1634
#define CLC1CON_MODE1                 1635
#define LC1MODE1                      1636
#define LC1MODE2                      1637
#define CLC1CON_MODE2                 1638
#define LC1INTN                       1639
#define CLC1CON_INTN                  1640
#define CLC1CON_INTP                  1641
#define LC1INTP                       1642
#define LC1OUT                        1643
#define CLC1CON_OUT                   1644
#define CLC1CON_EN                    1645
#define LC1EN                         1646
#define CLC1POL                       1647
#define LC1G1POL                      1648
