tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18346_tdd.h
#define LC4G2D1T                      2207
#define LC4G2D2N                      2208
#define CLC4GLS1_D2N                  2209
#define LC4G2D2T                      2210
#define CLC4GLS1_D2T                  2211
#define CLC4GLS1_D3N                  2212
#define LC4G2D3N                      2213
#define LC4G2D3T                      2214
#define CLC4GLS1_D3T                  2215
#define CLC4GLS1_D4N                  2216
#define LC4G2D4N                      2217
#define CLC4GLS1_D4T                  2218
#define LC4G2D4T                      2219
#define CLC4GLS2                      2220
#define CLC4GLS2_D1N                  2221
#define LC4G3D1N                      2222
#define CLC4GLS2_D1T                  2223
#define LC4G3D1T                      2224
#define LC4G3D2N                      2225
#define CLC4GLS2_D2N                  2226
#define LC4G3D2T                      2227
#define CLC4GLS2_D2T                  2228
#define CLC4GLS2_D3N                  2229
#define LC4G3D3N                      2230
#define CLC4GLS2_D3T                  2231
#define LC4G3D3T                      2232
#define LC4G3D4N                      2233
#define CLC4GLS2_D4N                  2234
#define LC4G3D4T                      2235
#define CLC4GLS2_D4T                  2236
#define CLC4GLS3                      2237
#define CLC4GLS3_G4D1N                2238
#define LC4G4D1N                      2239
#define LC4G4D1T                      2240
#define CLC4GLS3_G4D1T                2241
#define LC4G4D2N                      2242
#define CLC4GLS3_G4D2N                2243
#define LC4G4D2T                      2244
#define CLC4GLS3_G4D2T                2245
#define CLC4GLS3_G4D3N                2246
#define LC4G4D3N                      2247
#define CLC4GLS3_G4D3T                2248
#define LC4G4D3T                      2249
#define LC4G4D4N                      2250
#define CLC4GLS3_G4D4N                2251
#define LC4G4D4T                      2252
#define CLC4GLS3_G4D4T                2253
#define STATUS_SHAD                   2254
#define C_SHAD                        2255
#define DC_SHAD                       2256
#define Z_SHAD                        2257
#define WREG_SHAD                     2258
#define BSR_SHAD                      2259
#define PCLATH_SHAD                   2260
#define FSR0L_SHAD                    2261
#define FSR0H_SHAD                    2262
#define FSR1L_SHAD                    2263
#define FSR1H_SHAD                    2264
#define STKPTR                        2265
#define TOSL                          2266
#define TOSH                          2267

#endif // _PIC16LF18346_H_
